brew "awscli"
brew "direnv"
brew "docker"
brew "gh"
brew "git"
brew "jq"
brew "mysql@8.0"
brew "peco"
brew "ruby-build"
brew "rbenv"
brew "starship"
brew "terminal-notifier"
brew "wget"
brew "yarn"
brew "zsh-autosuggestions"
cask "alfred", args: { appdir: "/Applications" }
cask "aws-vpn-client", args: { appdir: "/Applications" }
cask "claude-code", args: { appdir: "/Applications" }
cask "discord", args: { appdir: "/Applications" }
cask "docker-desktop", args: { appdir: "/Applications" }
cask "firefox", args: { appdir: "/Applications" }
cask "font-hack-nerd-font", args: { appdir: "/Applications" }
cask "google-chrome", args: { appdir: "/Applications" }
cask "iterm2", args: { appdir: "/Applications" }
cask "karabiner-elements", args: { appdir: "/Applications" }
cask "notion", args: { appdir: "/Applications" }
cask "raycast", args: { appdir: "/Applications" }
cask "rectangle", args: { appdir: "/Applications" }
cask "sequel-ace", args: { appdir: "/Applications" }
cask "slack", args: { appdir: "/Applications" }
cask "visual-studio-code", args: { appdir: "/Applications" }
vscode "aliariff.slim-lint"
vscode "anthropic.claude-code"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "hashicorp.terraform"
vscode "janisdd.vscode-edit-csv"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "vscodevim.vim"
