# インストール先の指定
cask_args appdir: "/Applications"

# CLIアプリケーションの管理
brew "docker"
brew "gh"
brew "git"
brew "wget"
brew "direnv"
brew "yarn"
## JSONを扱うコマンドラインツール [https://stedolan.github.io/jq/]
brew "jq"
## AWS CLI [https://aws.amazon.com/jp/cli/]
brew "awscli"
## Rubyのバージョン管理 [https://github.com/rbenv/rbenv]
brew "rbenv"
## Rubyのインストールを簡単にするプラグイン [https://github.com/rbenv/ruby-build]
brew "ruby-build"
## シェルプロンプトのカスタマイズ [https://starship.rs/]
brew "starship"
## ctrl + r でコマンド履歴検索 [https://github.com/peco/peco]
brew "peco"
## zshの補完機能拡張 [https://github.com/zsh-users/zsh-autosuggestions]
brew "zsh-autosuggestions"

# デスクトップアプリケーションの管理
cask "alfred"
cask "iterm2"
cask "visual-studio-code"
cask "google-chrome"
cask "karabiner-elements"
cask "claude-code"
cask "raycast"
cask "notion"
cask "slack"
cask "docker-desktop"
# cask "zoom"
cask "discord"
cask "firefox"
cask "sequel-ace"
cask "rectangle"
### for work
cask "aws-vpn-client"
## ターミナルのフォントを変更 [https://github.com/ryanoasis/nerd-fonts]
cask "font-hack-nerd-font"
