# インストール先の指定
cask_args appdir: "/Applications"

# 外部ライブラリをインストール
tap "homebrew/cask-fonts"

# CLIアプリケーションの管理
brew "docker"
brew "gh"
brew "git"
brew "wget"
## シェルプロンプトのカスタマイズ [https://starship.rs/]
brew "starship"
## ctrl + r でコマンド履歴検索 [https://github.com/peco/peco]
brew "peco"

# デスクトップアプリケーションの管理
cask "iterm2"
cask "visual-studio-code"
cask "google-chrome"
cask "raycast"
cask "notion"
cask "slack"
cask "zoom"
cask "discord"
cask "firefox"
## ターミナルのフォントを変更 [https://github.com/ryanoasis/nerd-fonts]
cask "font-hack-nerd-font"
